{
  "DINNER MENU": [
    {
      "name": "Fried Calamari",
      "desc": "Delicious, tender, crispy, & crunchy calamari served with mild or hot marinara sauce for dipping"
    },
    {
      "name": "Fried Roman Artichokes",
      "desc": "Crispy-fried baby artichokes with lemon and salsa verde"
    },
    {
      "name": "Crab-Stuffed Jalapeño Popper",
      "desc": "Fresh jalapeno peppers stuffed with lump crab meat & cheese, wrapped in bacon & smoked. Glazed with a tangy homemade BBQ sauce"
    },
	{
	  "name": "Mamas Meatballs and Sausage",
	  "desc": "Our homemade meatballs are a delicious combination of ground beef, garlic, cheese & bread served with sweet Italian sausage simmered in Mamas meat sauce"
	},
	{
      "name": "Grilled Bruschetta with Fig Jam, Gorgonzola cheese & Prosciutto",
      "desc": "Baked artisan bread char-grilled topped with delicate fig jam, gorgonzola cheese & sliced prosciutto"
    },
	{
      "name": "Prince Edward Island Mussels",
      "desc": "Fresh plump & juicy Canadian mussels simmered in a white wine, garlic, shallots & tomato sauce"
    },
	{
      "name": "Panini Bay House Special",
      "desc": "Fresh crisp romaine lettuce served with our balsamic vinaigrette, pimento olives, plum tomatoes & red onion confit"
    },
	{
      "name": "Caesar Salad",
      "desc": "Crisp romaine, our homemade Caesar dressing, crunchy croutons & parmigiana reggiano cheese"
    },
	{
      "name": "Baby Greens & Goat Cheese",
      "desc": "Baby greens, creamy goat cheese, red onion confit & balsamic vinaigrette"
    },
	{
      "name": "Fresh Mozzarella and Tomato Salad",
      "desc": "Chunks of fresh mozzarella, plum tomatoes, fresh basil, red onion confit & balsamic vinaigrette. Served with grilled crostini"
    },
	{
      "name": "Creamy Shrimp Linguine",
      "desc": "Sautéed shrimp in a pink cream sauce flavored with white wine, prosciutto, shallots & parmesan cheese. Served over linguine pasta"
    },
	{
      "name": "Authentic Bolognese",
      "desc": "Ground veal, pork & beef slowly simmered with white wine, prosciutto, onion, carrots, cream & parmigiana reggiano cheese"
    },
	{
      "name": "Mamas Meat Sauce or Marinara",
      "desc": "Your choice of pasta with our deliciously rich slow simmered braised meat sauce or just marinara sauce. Dusted with pecorino romano cheese. Meat sauce 18 Marinara sauce"
    },
	{
      "name": "White or Red Clam Sauce",
      "desc": "Fresh local little neck clams from Parsons seafood, simmered in extra virgin olive oil, white wine & garlic. Served over imported linguini pasta"
    }
  ]
}
